tests/load/artillery-config.yml
# Artillery Load Test Configuration
# WebSocket and complex scenario testing

config:
  target: "ws://localhost:3000"
  phases:
    # Baseline
    - duration: 600
      arrivalRate: 10
      name: "Baseline - 100 users"

    # Ramp up
    - duration: 900
      arrivalRate: 50
      rampTo: 80
      name: "Ramp up - 500 users"

    # Sustained load
    - duration: 1800
      arrivalRate: 80
      name: "Sustained - 500 users"

    # Spike test
    - duration: 300
      arrivalRate: 200
      name: "Spike - 1500 users"

    # Peak load
    - duration: 1200
      arrivalRate: 300
      name: "Peak - 2000 users"

  # Performance thresholds
  ensure:
    maxErrorRate: 1 # Max 1% error rate
    p95: 1000 # 95th percentile under 1000ms
    p99: 2000 # 99th percentile under 2000ms

  # WebSocket configuration
  ws:
    # Reconnection settings
    reconnect: true
    reconnectDelay: 1000
    maxReconnectAttempts: 3

  # Load test plugins
  plugins:
    expect: {}
    metrics-by-endpoint: {}

  # Custom metrics
  processor: "./artillery-processor.js"

  # Test data
  payload:
    path: "./data/test-users.json"
    fields:
      - "email"
      - "password"
      - "organizationId"

# Test Scenarios
scenarios:
  # WebSocket real-time updates scenario
  - name: "Real-time Message Updates"
    engine: "ws"
    flow:
      # Authenticate
      - post:
          url: "http://localhost:3000/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"

      # Connect WebSocket
      - ws:
          url: "/api/realtime?token={{ authToken }}"
          actions:
            # Subscribe to conversations channel
            - send:
                payload: |
                  {
                    "type": "subscribe",
                    "channel": "conversations",
                    "organizationId": "{{ organizationId }}"
                  }

            # Wait for subscription confirmation
            - wait:
                seconds: 1

            # Subscribe to messages channel
            - send:
                payload: |
                  {
                    "type": "subscribe",
                    "channel": "messages",
                    "userId": "{{ userId }}"
                  }

            # Receive messages for 60 seconds
            - think:
                seconds: 60

            # Send heartbeat every 30 seconds
            - loop:
                count: 2
                flow:
                  - send:
                      payload: '{"type": "ping"}'
                  - think:
                      seconds: 30

            # Unsubscribe
            - send:
                payload: '{"type": "unsubscribe", "channel": "conversations"}'

            - send:
                payload: '{"type": "unsubscribe", "channel": "messages"}'

  # Conversation list updates
  - name: "Conversation List Polling"
    weight: 30
    flow:
      # Authenticate
      - post:
          url: "http://localhost:3000/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"

      # Poll conversation list
      - loop:
          count: 10
          flow:
            - get:
                url: "http://localhost:3000/api/conversations?status=open"
                headers:
                  Authorization: "Bearer {{ authToken }}"
                expect:
                  - statusCode: 200
                  - contentType: json
                  - hasProperty: data

            - think:
                seconds: 6 # 10 requests per minute

  # Message sending scenario
  - name: "Send Messages"
    weight: 20
    flow:
      # Authenticate
      - post:
          url: "http://localhost:3000/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"

      # Get conversations
      - get:
          url: "http://localhost:3000/api/conversations?status=open&limit=5"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.data[0].id"
              as: "conversationId"

      # Send messages
      - loop:
          count: 5
          flow:
            - post:
                url: "http://localhost:3000/api/conversations/{{ conversationId }}/messages"
                headers:
                  Authorization: "Bearer {{ authToken }}"
                json:
                  content: "Load test message at {{ $timestamp }}"
                  type: "text"
                expect:
                  - statusCode: [200, 201]

            - think:
                seconds: 30

  # Search and filter scenario
  - name: "Search Operations"
    weight: 15
    flow:
      # Authenticate
      - post:
          url: "http://localhost:3000/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"

      # Search conversations
      - get:
          url: "http://localhost:3000/api/conversations?search=test"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      - think:
          seconds: 3

      # Search contacts
      - get:
          url: "http://localhost:3000/api/contacts?search=john"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      - think:
          seconds: 3

      # Filter by tags
      - get:
          url: "http://localhost:3000/api/contacts?tags=vip,customer"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Analytics dashboard scenario
  - name: "Analytics Dashboard"
    weight: 10
    flow:
      # Authenticate as admin
      - post:
          url: "http://localhost:3000/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"

      # Load dashboard metrics
      - get:
          url: "http://localhost:3000/api/analytics/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - hasProperty: metrics

      - think:
          seconds: 5

      # Load performance metrics
      - get:
          url: "http://localhost:3000/api/analytics/performance"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      - think:
          seconds: 5

      # Real-time metrics
      - get:
          url: "http://localhost:3000/api/analytics/realtime"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Bulk operations scenario
  - name: "Bulk Operations"
    weight: 5
    flow:
      # Authenticate
      - post:
          url: "http://localhost:3000/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"

      # Create bulk message job
      - post:
          url: "http://localhost:3000/api/bulk/messages"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            contactIds: ["{{ $randomString() }}", "{{ $randomString() }}"]
            message: "Bulk test message"
            scheduleAt: null
          capture:
            - json: "$.jobId"
              as: "jobId"
          expect:
            - statusCode: [200, 201]

      - think:
          seconds: 2

      # Check job status
      - loop:
          count: 5
          flow:
            - get:
                url: "http://localhost:3000/api/jobs/{{ jobId }}"
                headers:
                  Authorization: "Bearer {{ authToken }}"
                expect:
                  - statusCode: 200

            - think:
                seconds: 10

  # Contact management scenario
  - name: "Contact Management"
    weight: 10
    flow:
      # Authenticate
      - post:
          url: "http://localhost:3000/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"

      # List contacts
      - get:
          url: "http://localhost:3000/api/contacts?limit=20"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      - think:
          seconds: 2

      # Create new contact
      - post:
          url: "http://localhost:3000/api/contacts"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "Load Test Contact {{ $randomString() }}"
            phoneNumber: "+1{{ $randomNumber(2000000000, 9999999999) }}"
            email: "loadtest{{ $randomString() }}@test.com"
          capture:
            - json: "$.id"
              as: "contactId"
          expect:
            - statusCode: [200, 201]

      - think:
          seconds: 1

      # Update contact
      - put:
          url: "http://localhost:3000/api/contacts/{{ contactId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            tags: ["test", "load-test"]
          expect:
            - statusCode: 200

      - think:
          seconds: 1

      # Get contact details
      - get:
          url: "http://localhost:3000/api/contacts/{{ contactId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Template management scenario
  - name: "Template Operations"
    weight: 5
    flow:
      # Authenticate
      - post:
          url: "http://localhost:3000/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"

      # List templates
      - get:
          url: "http://localhost:3000/api/templates"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      - think:
          seconds: 2

      # Use template in message
      - get:
          url: "http://localhost:3000/api/templates?category=greeting"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.data[0].id"
              as: "templateId"
          expect:
            - statusCode: 200